Revit 2015 API
WallTypeSet.Insert Method
Insert the specified wall type into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual bool Insert(
	WallType item
)
Visual Basic
Public Overridable Function Insert ( _
	item As WallType _
) As Boolean
Visual C++
public:
virtual bool Insert(
	WallType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.WallType
The wall type to be inserted into the set.
Return Value
Returns whether the wall type was inserted into the set.
See Also
WallTypeSet Class
Autodesk.Revit.DB Namespace